dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/DEBUGSS_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="DEBUGSS" HW_revision="1.0">
    <register id="DEBUGSS_IIDX" width="32" offset="0x1020" description="Interrupt index">
        <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="NO_INTR" value="0x0" description="No pending interrupt request"/>
            <bitenum id="TXIFG" value="0x1" description="TX interrupt"/>
            <bitenum id="RXIFG" value="0x2" description="RX interrupt"/>
            <bitenum id="PWRUP" value="0x3" description="Power-up interrupt. A debug session has started."/>
            <bitenum id="PWRDWN" value="0x4" description="Power-up interrupt. A debug session has started."/>
        </bitfield>
    </register>
    <register id="DEBUGSS_IMASK" width="32" offset="0x1028" description="Interrupt mask">
        <bitfield id="TXIFG" description="Masks TXIFG in MIS register" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
            <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
        </bitfield>
        <bitfield id="RXIFG" description="Masks RXIFG in MIS register" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
            <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
        </bitfield>
        <bitfield id="PWRUPIFG" description="Masks PWRUPIFG in MIS register" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
            <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
        </bitfield>
        <bitfield id="PWRDWNIFG" description="Masks PWRDWNIFG in MIS register" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
            <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_RIS" width="32" offset="0x1030" description="Raw interrupt status">
        <bitfield id="TXIFG" description="Raw interrupt status for TXIFG" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="TXIFG did not occur"/>
            <bitenum id="SET" value="0x1" description="TXIFG occurred"/>
        </bitfield>
        <bitfield id="RXIFG" description="Raw interrupt status for RXIFG" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="RXIFG did not occur"/>
            <bitenum id="SET" value="0x1" description="RXIFG occurred"/>
        </bitfield>
        <bitfield id="PWRUPIFG" description="Raw interrupt status for PWRUPIFG" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="PWRUPIFG did not occur"/>
            <bitenum id="SET" value="0x1" description="PWRUPIFG occurred"/>
        </bitfield>
        <bitfield id="PWRDWNIFG" description="Raw interrupt status for PWRDWNIFG" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="PWRUPIFG did not occur"/>
            <bitenum id="SET" value="0x1" description="PWRUPIFG occurred"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_MIS" width="32" offset="0x1038" description="Masked interrupt status">
        <bitfield id="TXIFG" description="Masked interrupt status for TXIFG" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="TXIFG did not request an interrupt service routine"/>
            <bitenum id="SET" value="0x1" description="TXIFG requests an interrupt service routine"/>
        </bitfield>
        <bitfield id="RXIFG" description="Masked interrupt status for RXIFG" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="RXIFG did not request an interrupt service routine"/>
            <bitenum id="SET" value="0x1" description="RXIFG requests an interrupt service routine"/>
        </bitfield>
        <bitfield id="PWRUPIFG" description="Masked interrupt status for PWRUPIFG" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="PWRUPIFG did not request an interrupt service routine"/>
            <bitenum id="SET" value="0x1" description="PWRUPIFG requests an interrupt service routine"/>
        </bitfield>
        <bitfield id="PWRDWNIFG" description="Masked interrupt status for PWRDWNIFG" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="PWRUPIFG did not request an interrupt service routine"/>
            <bitenum id="SET" value="0x1" description="PWRUPIFG requests an interrupt service routine"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_ISET" width="32" offset="0x1040" description="Interrupt set">
        <bitfield id="TXIFG" description="Sets TXIFG in RIS register" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="RIS bit corresponding to TXIFG is set"/>
        </bitfield>
        <bitfield id="RXIFG" description="Sets RXIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="RIS bit corresponding to RXIFG is set"/>
        </bitfield>
        <bitfield id="PWRUPIFG" description="Sets PWRUPIFG in RIS register" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="RIS bit corresponding to PWRUPIFG is set"/>
        </bitfield>
        <bitfield id="PWRDWNIFG" description="Sets PWRDWNIFG in RIS register" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="RIS bit corresponding to PWRUPIFG is set"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_ICLR" width="32" offset="0x1048" description="Interrupt clear">
        <bitfield id="TXIFG" description="Clears TXIFG in RIS register" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="RIS bit corresponding to TXIFG is cleared"/>
        </bitfield>
        <bitfield id="RXIFG" description="Clears RXIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="RIS bit corresponding to RXIFG is cleared"/>
        </bitfield>
        <bitfield id="PWRUPIFG" description="Clears PWRUPIFG in RIS register" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="RIS bit corresponding to PWRUPIFG is cleared"/>
        </bitfield>
        <bitfield id="PWRDWNIFG" description="Clears PWRDWNIFG in RIS register" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="RIS bit corresponding to PWRUPIFG is cleared"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for peripheral events" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="DEBUGSS_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DEBUGSS_TXD" width="32" offset="0x1100" description="Transmit data register">
    </register>
    <register id="DEBUGSS_TXCTL" width="32" offset="0x1104" description="Transmit control register">
        <bitfield id="TRANSMIT" description="Indicates data request in DSSM.TXD, set on write via Debug AP to DSSM.TXD.

A read of the DSSM.TXD register by SW will clear the TX field. The tool can check that TXD is empty by reading this field." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="EMPTY" value="0x0" description="TXD is empty"/>
            <bitenum id="FULL" value="0x1" description="TXD is full"/>
        </bitfield>
        <bitfield id="TRANSMIT_FLAGS" description="Generic TX flags that can be set by external debug tool. Functionality is defined by SW." begin="31" end="1" width="31" rwaccess="R">
        </bitfield>
    </register>
    <register id="DEBUGSS_RXD" width="32" offset="0x1108" description="Receive data register">
    </register>
    <register id="DEBUGSS_RXCTL" width="32" offset="0x110C" description="Receive control register">
        <bitfield id="RECEIVE" description="Indicates SW write to the DSSM.RXD register.
A read of the DSSM.RXD register by SWD Access Port will clear the RX field." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="EMPTY" value="0x0" description="RXD empty"/>
            <bitenum id="FULL" value="0x1" description="RXD full"/>
        </bitfield>
        <bitfield id="RECEIVE_FLAGS" description="Generic RX flags that can be set by SW and read by external debug tool. Functionality is defined by SW." begin="7" end="1" width="7" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DEBUGSS_SPECIAL_AUTH" width="32" offset="0x1200" description="Special enable authorization register">
        <bitfield id="SECAPEN" description="An active high input. When asserted (and SWD access is also permitted), the debug tools can use the Security-AP to communicate with security control logic. When deasserted, a DAPBUS firewall will isolate the AP and prevent access to the Security-AP." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable SEC-AP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable SEC-AP"/>
        </bitfield>
        <bitfield id="SWDPORTEN" description="When asserted, the SW-DP functions normally. 
When deasserted, the SW-DP effectively disables all external debug access." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable SWD port"/>
            <bitenum id="ENABLE" value="0x1" description="Enable SWD port"/>
        </bitfield>
        <bitfield id="DFTAPEN" description="An active high input. When asserted (and SWD access is also permitted), the debug tools can then access the DFT-AP external to the DebugSS lite. When deasserted, a DAPBUS firewall will isolate the AP and prevent access." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable DFT-TAP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable DFT-TAP"/>
        </bitfield>
        <bitfield id="ETAPEN" description="An active high input. When asserted (and SWD access is also permitted), the debug tools can then access an ET-AP external to the DebugSS lite. When deasserted, a DAPBUS firewall will isolate the AP and prevent access." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable ET+ -AP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable ET+ -AP"/>
        </bitfield>
        <bitfield id="CFGAPEN" description="An active high input. When asserted (and SWD access is also permitted), the debug tools can use the Config-AP to read device configuration information. When deasserted, a DAPBUS firewall will isolate the AP and prevent access to the Config-AP." begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable CFG-AP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable CFG-AP"/>
        </bitfield>
        <bitfield id="AHBAPEN" description="Disabling / enabling debug access to the M0+ Core via the AHB-AP DAP bus isolation." begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable AHB-AP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable AHB-AP"/>
        </bitfield>
        <bitfield id="PWRAPEN" description="An active high input. When asserted (and SWD access is also permitted), the debug tools can then access the PWR-AP to power and reset state of the CPU. When deasserted, a DAPBUS firewall will isolate the AP and prevent access." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable PWR-AP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable PWR-AP"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_APP_AUTH" width="32" offset="0x1210" description="Application CPU0 authorization register">
        <bitfield id="DBGEN" description="Controls invasive debug enable." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Invasive debug disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Invasive debug enabled"/>
        </bitfield>
        <bitfield id="NIDEN" description="Controls non-invasive debug enable." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Non-invasive debug disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Non-invasive debug enabled"/>
        </bitfield>
        <bitfield id="SPIDEN" description="Secure invasive debug enable." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Invasive debug disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Invasive debug enabled"/>
        </bitfield>
        <bitfield id="SPNIDEN" description="Secure non-invasive debug enable." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Invasive debug disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Invasive debug enabled"/>
        </bitfield>
    </register>

</module>